# The Pandas Library, an Introduction

In [2]:
import pandas as pd
import numpy as np

## Introduction to Pandas Data Structures

### Declaring a Series

In [3]:
s = pd.Series([12, -4, 7, 9])
s

0    12
1    -4
2     7
3     9
dtype: int64

In [4]:
s = pd.Series([12, -4, 7, 9], index=['a', 'b', 'c', 'd'])
s

a    12
b    -4
c     7
d     9
dtype: int64

In [5]:
s.values

array([12, -4,  7,  9], dtype=int64)

In [6]:
s.index

Index(['a', 'b', 'c', 'd'], dtype='object')

### Selecting the Internal Elements

In [7]:
s[2]

7

In [8]:
s['b']

-4

In [9]:
s[0:2]

a    12
b    -4
dtype: int64

In [10]:
s[['b','c']]

b   -4
c    7
dtype: int64

### Assigning Values to the Elements

In [11]:
s[1] = 0
s

a    12
b     0
c     7
d     9
dtype: int64

In [12]:
s['b'] = 1
s

a    12
b     1
c     7
d     9
dtype: int64

### Defining Series from NumPy Arrays and Other Series

In [13]:
arr = np.array([1, 2, 3, 4])
s3 = pd.Series(arr)
s3

0    1
1    2
2    3
3    4
dtype: int32

In [14]:
s4 = pd.Series(s)
s4

a    12
b     1
c     7
d     9
dtype: int64

In [15]:
s3

0    1
1    2
2    3
3    4
dtype: int32

### Filtering Values

In [16]:
s[s > 8]

a    12
d     9
dtype: int64

### Operations and Mathematical Functions

In [17]:
s / 2

a    6.0
b    0.5
c    3.5
d    4.5
dtype: float64

In [18]:
np.log(s)

a    2.484907
b    0.000000
c    1.945910
d    2.197225
dtype: float64

### Evaluating Values

In [19]:
serd = pd.Series([1,0,2,1,2,3], index=['white', 'white', 'blue', 'green', 'green', 'yellow'])
serd

white     1
white     0
blue      2
green     1
green     2
yellow    3
dtype: int64

In [20]:
serd.unique()

array([1, 0, 2, 3], dtype=int64)

In [21]:
serd.value_counts()

2    2
1    2
3    1
0    1
dtype: int64

In [22]:
serd.isin([0,3])

white     False
white      True
blue      False
green     False
green     False
yellow     True
dtype: bool

In [23]:
serd[serd.isin([0,3])]

white     0
yellow    3
dtype: int64

### NaN Values

In [24]:
s2 = pd.Series([5, -3, np.NaN, 14])
s2

0     5.0
1    -3.0
2     NaN
3    14.0
dtype: float64

In [25]:
s2.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [26]:
s2.notnull()

0     True
1     True
2    False
3     True
dtype: bool

In [27]:
s2[s2.notnull()]

0     5.0
1    -3.0
3    14.0
dtype: float64

In [28]:
s2[s2.isnull()]

2   NaN
dtype: float64

### Series as Dictionaries

In [29]:
mydict = {'red': 2000, 'blue': 1000, 'yellow': 500, 'orange': 1000}
myseries = pd.Series(mydict)
myseries

blue      1000
orange    1000
red       2000
yellow     500
dtype: int64

In [30]:
colors = ['red', 'yellow', 'orange', 'blue', 'green']
myseries = pd.Series(mydict, index=colors)
myseries

red       2000.0
yellow     500.0
orange    1000.0
blue      1000.0
green        NaN
dtype: float64

### Operations between Series

In [31]:
mydict2 = {'red': 400, 'yellow': 1000, 'black': 700}
myseries2 = pd.Series(mydict2)
myseries + myseries2

black        NaN
blue         NaN
green        NaN
orange       NaN
red       2400.0
yellow    1500.0
dtype: float64

## The DataFrame

### Defining a DataFrame

In [32]:
data = {'color' : ['blue', 'green', 'yellow', 'red', 'white'],
        'object' : ['ball', 'pen', 'pencil', 'paper', 'mug'],
        'price' : [1.2, 1.0, 0.6, 0.9, 1.7]}
frame = pd.DataFrame(data)
frame

    color  object  price
0    blue    ball    1.2
1   green     pen    1.0
2  yellow  pencil    0.6
3     red   paper    0.9
4   white     mug    1.7

In [33]:
frame2 = pd.DataFrame(data, columns=['object', 'price'])
frame2

   object  price
0    ball    1.2
1     pen    1.0
2  pencil    0.6
3   paper    0.9
4     mug    1.7

In [34]:
frame2 = pd.DataFrame(data, index=['one', 'two', 'three', 'four', 'five'])
frame2

        color  object  price
one      blue    ball    1.2
two     green     pen    1.0
three  yellow  pencil    0.6
four      red   paper    0.9
five    white     mug    1.7

In [35]:
frame3 = pd.DataFrame(np.arange(16).reshape((4,4)),
                     index=['red', 'blue', 'yellow', 'white'],
                     columns=['ball', 'pen', 'pencil', 'paper'])
frame3

        ball  pen  pencil  paper
red        0    1       2      3
blue       4    5       6      7
yellow     8    9      10     11
white     12   13      14     15

### Selecting Elements

In [36]:
frame.columns

Index(['color', 'object', 'price'], dtype='object')

In [37]:
frame.index

RangeIndex(start=0, stop=5, step=1)

In [38]:
frame.values

array([['blue', 'ball', 1.2],
       ['green', 'pen', 1.0],
       ['yellow', 'pencil', 0.6],
       ['red', 'paper', 0.9],
       ['white', 'mug', 1.7]], dtype=object)

In [39]:
frame['price']

0    1.2
1    1.0
2    0.6
3    0.9
4    1.7
Name: price, dtype: float64

In [40]:
frame.price

0    1.2
1    1.0
2    0.6
3    0.9
4    1.7
Name: price, dtype: float64

In [41]:
frame.ix[2]

C:\Users\nelli\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

color     yellow
object    pencil
price        0.6
Name: 2, dtype: object

In [44]:
a = frame.loc[2]
a

color     yellow
object    pencil
price        0.6
Name: 2, dtype: object

In [43]:
frame.iloc[2]

color     yellow
object    pencil
price        0.6
Name: 2, dtype: object

In [45]:
frame.iloc[[2,4]]

    color  object  price
2  yellow  pencil    0.6
4   white     mug    1.7

In [46]:
#deprecated
frame.ix[[2,4]]

    color  object  price
2  yellow  pencil    0.6
4   white     mug    1.7

In [47]:
frame[0:1]

  color object  price
0  blue   ball    1.2

In [48]:
frame[1:3]

    color  object  price
1   green     pen    1.0
2  yellow  pencil    0.6

In [49]:
frame['object'][3]

'paper'

### Assigning Values

In [50]:
frame.index.name = 'id'; 
frame.columns.name = 'item'
frame

item   color  object  price
id
0       blue    ball    1.2
1      green     pen    1.0
2     yellow  pencil    0.6
3        red   paper    0.9
4      white     mug    1.7

In [51]:
frame['new'] = 12
frame

item   color  object  price  new
id
0       blue    ball    1.2   12
1      green     pen    1.0   12
2     yellow  pencil    0.6   12
3        red   paper    0.9   12
4      white     mug    1.7   12

In [52]:
frame['new'] = [3.0, 1.3, 2.2, 0.8, 1.1]
frame

item   color  object  price  new
id
0       blue    ball    1.2  3.0
1      green     pen    1.0  1.3
2     yellow  pencil    0.6  2.2
3        red   paper    0.9  0.8
4      white     mug    1.7  1.1

In [53]:
ser = pd.Series(np.arange(5))
ser

0    0
1    1
2    2
3    3
4    4
dtype: int32

In [54]:
frame['new'] = ser
frame

item   color  object  price  new
id
0       blue    ball    1.2    0
1      green     pen    1.0    1
2     yellow  pencil    0.6    2
3        red   paper    0.9    3
4      white     mug    1.7    4

In [55]:
frame['price'][2] = 3.3

C:\Users\nelli\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

### Membership of a Value

In [56]:
frame.isin([1.0, 'pen'])

item  color  object  price    new
id
0     False   False  False  False
1     False    True   True   True
2     False   False  False  False
3     False   False  False  False
4     False   False  False  False

In [57]:
frame[frame.isin([1.0, 'pen'])]

item color object  price  new
id
0      NaN    NaN    NaN  NaN
1      NaN    pen    1.0  1.0
2      NaN    NaN    NaN  NaN
3      NaN    NaN    NaN  NaN
4      NaN    NaN    NaN  NaN

### Deleting a Column

In [58]:
del frame['new']
frame

item   color  object  price
id
0       blue    ball    1.2
1      green     pen    1.0
2     yellow  pencil    3.3
3        red   paper    0.9
4      white     mug    1.7

### Filtering

In [59]:
frame[frame < 1.2]

item   color  object  price
id
0       blue    ball    NaN
1      green     pen    1.0
2     yellow  pencil    NaN
3        red   paper    0.9
4      white     mug    NaN

### DataFrame from Nested dict

In [60]:
nestdict = {'red': { 2012: 22, 2013: 33},
            'white': { 2011: 13, 2012: 22, 2013: 16},
            'blue': { 2011: 17, 2012: 27, 2013: 18}}
frame2 = pd.DataFrame(nestdict)
frame2

      blue   red  white
2011    17   NaN     13
2012    27  22.0     22
2013    18  33.0     16

### Transposition of a DataFrame

In [61]:
frame2.T

       2011  2012  2013
blue   17.0  27.0  18.0
red     NaN  22.0  33.0
white  13.0  22.0  16.0

## The Index Objects

In [62]:
ser = pd.Series([5, 0, 3, 8, 4], index=['red', 'blue', 'yellow', 'white', 'green'])
ser.index

Index(['red', 'blue', 'yellow', 'white', 'green'], dtype='object')

### Methods on Index

In [63]:
ser.idxmin()

'blue'

In [64]:
ser.idxmax()

'white'

### Index with Duplicate Labels

In [65]:
serd = pd.Series(range(6), index=['white', 'white', 'blue', 'green', 'green', 'yellow'])
serd

white     0
white     1
blue      2
green     3
green     4
yellow    5
dtype: int64

In [66]:
serd['white']

white    0
white    1
dtype: int64

In [67]:
serd.index.is_unique

False

In [68]:
frame.index.is_unique

True

 ### Other Functionalities on Indexes

In [69]:
ser = pd.Series([2, 5, 7, 4], index=['one', 'two', 'three', 'four'])
ser

one      2
two      5
three    7
four     4
dtype: int64

In [70]:
ser.reindex(['three', 'four', 'five', 'one'])

three    7.0
four     4.0
five     NaN
one      2.0
dtype: float64

In [71]:
ser3 = pd.Series([1, 5, 6, 3], index=[0, 3, 5, 6])
ser3

0    1
3    5
5    6
6    3
dtype: int64

In [72]:
ser3.reindex(range(6), method='ffill')

0    1
1    1
2    1
3    5
4    5
5    6
dtype: int64

In [73]:
ser3.reindex(range(6), method='bfill')

0    1
1    5
2    5
3    5
4    6
5    6
dtype: int64

In [74]:
frame.reindex(range(5), method='ffill', columns=['colors', 'price', 'new', 'object'])

item  colors  price     new  object
id
0       blue    1.2    blue    ball
1      green    1.0   green     pen
2     yellow    3.3  yellow  pencil
3        red    0.9     red   paper
4      white    1.7   white     mug

### Dropping

In [75]:
ser = pd.Series(np.arange(4.), index=['red', 'blue', 'yellow', 'white'])
ser

red       0.0
blue      1.0
yellow    2.0
white     3.0
dtype: float64

In [76]:
ser.drop('yellow')

red      0.0
blue     1.0
white    3.0
dtype: float64

In [77]:
ser.drop(['blue','white'])

red       0.0
yellow    2.0
dtype: float64

In [78]:
frame = pd.DataFrame(np.arange(16).reshape((4,4)), 
                    index=['red', 'blue', 'yellow', 'white'],
                    columns=['ball', 'pen', 'pencil', 'paper'])
frame

        ball  pen  pencil  paper
red        0    1       2      3
blue       4    5       6      7
yellow     8    9      10     11
white     12   13      14     15

In [79]:
frame.drop(['blue','yellow'])

       ball  pen  pencil  paper
red       0    1       2      3
white    12   13      14     15

In [80]:
frame.drop(['pen','pencil'], axis=1)

        ball  paper
red        0      3
blue       4      7
yellow     8     11
white     12     15

### Arithmetic and Data Alignment

In [81]:
s1 = pd.Series([3,2,5,1],['white','yellow','green','blue'])
s2 = pd.Series([1,4,7,2,1],['white','yellow','black','blue','brown'])

In [82]:
s1 + s2

black     NaN
blue      3.0
brown     NaN
green     NaN
white     4.0
yellow    6.0
dtype: float64

In [83]:
frame1 = pd.DataFrame(np.arange(16).reshape((4,4)),
          index=['red', 'blue', 'yellow', 'white'],
          columns=['ball','pen','pencil','paper'])
frame2 = pd.DataFrame(np.arange(12).reshape((4,3)),
          index=['blue', 'green', 'white', 'yellow'],
          columns=['mug','pen','ball'])
frame1

        ball  pen  pencil  paper
red        0    1       2      3
blue       4    5       6      7
yellow     8    9      10     11
white     12   13      14     15

In [85]:
frame2

        mug  pen  ball
blue      0    1     2
green     3    4     5
white     6    7     8
yellow    9   10    11

In [86]:
frame1 + frame2

        ball  mug  paper   pen  pencil
blue     6.0  NaN    NaN   6.0     NaN
green    NaN  NaN    NaN   NaN     NaN
red      NaN  NaN    NaN   NaN     NaN
white   20.0  NaN    NaN  20.0     NaN
yellow  19.0  NaN    NaN  19.0     NaN

## Operations between Data Structures

### Flexible Arithmetic Methods

In [87]:
frame1.add(frame2)

        ball  mug  paper   pen  pencil
blue     6.0  NaN    NaN   6.0     NaN
green    NaN  NaN    NaN   NaN     NaN
red      NaN  NaN    NaN   NaN     NaN
white   20.0  NaN    NaN  20.0     NaN
yellow  19.0  NaN    NaN  19.0     NaN

### Operations between DataFrame and Series

In [88]:
frame = pd.DataFrame(np.arange(16).reshape((4,4)),
          index=['red', 'blue', 'yellow', 'white'],
          columns=['ball','pen','pencil','paper'])
frame

        ball  pen  pencil  paper
red        0    1       2      3
blue       4    5       6      7
yellow     8    9      10     11
white     12   13      14     15

In [89]:
ser = pd.Series(np.arange(4), index=['ball','pen','pencil','paper'])
ser

ball      0
pen       1
pencil    2
paper     3
dtype: int32

In [90]:
frame - ser

        ball  pen  pencil  paper
red        0    0       0      0
blue       4    4       4      4
yellow     8    8       8      8
white     12   12      12     12

In [91]:
ser['mug'] = 9
ser

ball      0
pen       1
pencil    2
paper     3
mug       9
dtype: int64

In [92]:
frame - ser

        ball  mug  paper  pen  pencil
red        0  NaN      0    0       0
blue       4  NaN      4    4       4
yellow     8  NaN      8    8       8
white     12  NaN     12   12      12

## Function Application and Mapping

### Functions by Element

In [93]:
frame = pd.DataFrame(np.arange(16).reshape((4,4)),
          index=['red', 'blue', 'yellow', 'white'],
          columns=['ball','pen','pencil','paper'])
np.sqrt(frame)

            ball       pen    pencil     paper
red     0.000000  1.000000  1.414214  1.732051
blue    2.000000  2.236068  2.449490  2.645751
yellow  2.828427  3.000000  3.162278  3.316625
white   3.464102  3.605551  3.741657  3.872983

### Functions by Row or Column

In [94]:
f = lambda x: x.max() - x.min()

def f(x):
    return x.max() - x.min()

frame.apply(f)

ball      12
pen       12
pencil    12
paper     12
dtype: int64

In [95]:
frame.apply(f, axis=1)

red       3
blue      3
yellow    3
white     3
dtype: int64

In [96]:
def f(x):
    return pd.Series([x.min(), x.max()], index=['min', 'max'])
frame.apply(f)

     ball  pen  pencil  paper
min     0    1       2      3
max    12   13      14     15

In [97]:
frame.sum()

ball      24
pen       28
pencil    32
paper     36
dtype: int64

In [98]:
frame.mean()

ball      6.0
pen       7.0
pencil    8.0
paper     9.0
dtype: float64

In [99]:
frame.describe()

            ball        pen     pencil      paper
count   4.000000   4.000000   4.000000   4.000000
mean    6.000000   7.000000   8.000000   9.000000
std     5.163978   5.163978   5.163978   5.163978
min     0.000000   1.000000   2.000000   3.000000
25%     3.000000   4.000000   5.000000   6.000000
50%     6.000000   7.000000   8.000000   9.000000
75%     9.000000  10.000000  11.000000  12.000000
max    12.000000  13.000000  14.000000  15.000000

## Sorting and Ranking

In [100]:
ser = pd.Series([5, 0, 3, 8, 4], index=['red','blue','yellow','white','green'])
ser

red       5
blue      0
yellow    3
white     8
green     4
dtype: int64

In [101]:
ser.sort_index()

blue      0
green     4
red       5
white     8
yellow    3
dtype: int64

In [102]:
ser.sort_index(ascending=False)

yellow    3
white     8
red       5
green     4
blue      0
dtype: int64

In [103]:
frame = pd.DataFrame(np.arange(16).reshape((4,4)),
          index=['red', 'blue', 'yellow', 'white'],
          columns=['ball','pen','pencil','paper'])
frame

        ball  pen  pencil  paper
red        0    1       2      3
blue       4    5       6      7
yellow     8    9      10     11
white     12   13      14     15

In [104]:
frame.sort_index()

        ball  pen  pencil  paper
blue       4    5       6      7
red        0    1       2      3
white     12   13      14     15
yellow     8    9      10     11

In [105]:
frame.sort_index(axis=1)

        ball  paper  pen  pencil
red        0      3    1       2
blue       4      7    5       6
yellow     8     11    9      10
white     12     15   13      14

In [112]:
ser.sort_values()

blue      0
yellow    3
green     4
red       5
white     8
dtype: int64

In [113]:
frame.sort_values(by='pen')

        ball  pen  pencil  paper
red        0    1       2      3
blue       4    5       6      7
yellow     8    9      10     11
white     12   13      14     15

In [114]:
frame.sort_values(by=['pen','pencil'])

        ball  pen  pencil  paper
red        0    1       2      3
blue       4    5       6      7
yellow     8    9      10     11
white     12   13      14     15

In [115]:
ser.rank()

red       4.0
blue      1.0
yellow    2.0
white     5.0
green     3.0
dtype: float64

In [116]:
ser.rank(method='first')

red       4.0
blue      1.0
yellow    2.0
white     5.0
green     3.0
dtype: float64

In [117]:
ser.rank(ascending=False)

red       2.0
blue      5.0
yellow    4.0
white     1.0
green     3.0
dtype: float64

## Correlation and Covariance

In [118]:
seq = pd.Series([1,2,3,4,4,3,2,1],['2006','2007','2008','2009','2010','2011','2012','2013'])
seq2 = pd.Series([3,4,3,4,5,4,3,2],['2006','2007','2008','2009','2010','2011','2012','2013'])
seq.corr(seq2)

0.77459666924148352

In [119]:
seq.cov(seq2)

0.8571428571428571

In [121]:
frame2 = pd.DataFrame([[1,4,3,6],[4,5,6,1],[3,3,1,5],[4,1,6,4]],
          index=['red', 'blue', 'yellow', 'white'],
          columns=['ball','pen','pencil','paper'])
frame2

        ball  pen  pencil  paper
red        1    4       3      6
blue       4    5       6      1
yellow     3    3       1      5
white      4    1       6      4

In [122]:
frame2.corr()

            ball       pen    pencil     paper
ball    1.000000 -0.276026  0.577350 -0.763763
pen    -0.276026  1.000000 -0.079682 -0.361403
pencil  0.577350 -0.079682  1.000000 -0.692935
paper  -0.763763 -0.361403 -0.692935  1.000000

In [123]:
frame2.cov()

            ball       pen    pencil     paper
ball    2.000000 -0.666667  2.000000 -2.333333
pen    -0.666667  2.916667 -0.333333 -1.333333
pencil  2.000000 -0.333333  6.000000 -3.666667
paper  -2.333333 -1.333333 -3.666667  4.666667

In [130]:
ser = pd.Series([0, 1, 2, 3, 9], index=['red','blue','yellow','white','green'])
ser

red       0
blue      1
yellow    2
white     3
green     9
dtype: int64

In [131]:
frame2.corrwith(ser)

ball      0.730297
pen      -0.831522
pencil    0.210819
paper    -0.119523
dtype: float64

In [132]:
frame2.corrwith(frame)

ball      0.730297
pen      -0.831522
pencil    0.210819
paper    -0.119523
dtype: float64

## "Not a Number" Data

### Assigning a NaN Value

In [133]:
ser = pd.Series([0,1,2,np.NaN,9], index=['red','blue','yellow','white','green'])
ser

red       0.0
blue      1.0
yellow    2.0
white     NaN
green     9.0
dtype: float64

In [134]:
ser['white'] = None
ser

red       0.0
blue      1.0
yellow    2.0
white     NaN
green     9.0
dtype: float64

### FIltering Out NaN Values

In [135]:
ser.dropna()

red       0.0
blue      1.0
yellow    2.0
green     9.0
dtype: float64

In [136]:
ser[ser.notnull()]

red       0.0
blue      1.0
yellow    2.0
green     9.0
dtype: float64

In [137]:
frame3 = pd.DataFrame([[6,np.nan,6],[np.nan,np.nan,np.nan],[2,np.nan,5]],
                     index=['blue','green','red'],
                     columns=['ball','mug','pen'])
frame3

       ball  mug  pen
blue    6.0  NaN  6.0
green   NaN  NaN  NaN
red     2.0  NaN  5.0

In [138]:
frame3.dropna()

Empty DataFrame
Columns: [ball, mug, pen]
Index: []

In [139]:
frame3.dropna(how='all')

      ball  mug  pen
blue   6.0  NaN  6.0
red    2.0  NaN  5.0

### Filliing in NaN Occurrences

In [140]:
frame3.fillna(0)

       ball  mug  pen
blue    6.0  0.0  6.0
green   0.0  0.0  0.0
red     2.0  0.0  5.0

In [141]:
frame3.fillna({'ball':1, 'mug':0, 'pen': 99})

       ball  mug   pen
blue    6.0  0.0   6.0
green   1.0  0.0  99.0
red     2.0  0.0   5.0

## Hierarchical Indexing and Leveling

In [142]:
mser = pd.Series(np.random.rand(8),
                index=[['white','white','white','blue','blue','red','red','red'],
                      ['up','down','right','up','down','up','down','left']])
mser

white  up       0.661039
       down     0.512268
       right    0.639885
blue   up       0.081480
       down     0.408367
red    up       0.465264
       down     0.374153
       left     0.325975
dtype: float64

In [143]:
mser.index

MultiIndex(levels=[['blue', 'red', 'white'], ['down', 'left', 'right', 'up']],
           labels=[[2, 2, 2, 0, 0, 1, 1, 1], [3, 0, 2, 3, 0, 3, 0, 1]])

In [144]:
mser['white']

up       0.661039
down     0.512268
right    0.639885
dtype: float64

In [145]:
mser[:,'up']

white    0.661039
blue     0.081480
red      0.465264
dtype: float64

In [146]:
mser['white','up']

0.66103875558038194

In [147]:
mser.unstack()

           down      left     right        up
blue   0.408367       NaN       NaN  0.081480
red    0.374153  0.325975       NaN  0.465264
white  0.512268       NaN  0.639885  0.661039

In [148]:
frame

        ball  pen  pencil  paper
red        0    1       2      3
blue       4    5       6      7
yellow     8    9      10     11
white     12   13      14     15

In [149]:
frame.stack()

red     ball       0
        pen        1
        pencil     2
        paper      3
blue    ball       4
        pen        5
        pencil     6
        paper      7
yellow  ball       8
        pen        9
        pencil    10
        paper     11
white   ball      12
        pen       13
        pencil    14
        paper     15
dtype: int32

In [151]:
mframe = pd.DataFrame(np.random.randn(16).reshape(4,4),
                     index=[['white','white','red','red'], ['up','down','up','down']],
                     columns=[['pen','pen','paper','paper'],[1,2,1,2]])
mframe

                 pen               paper
                   1         2         1         2
white up    1.562883  0.919727 -0.397509 -0.314159
      down  0.580848  1.124744  0.741454 -0.035455
red   up   -1.721348  0.989703 -1.454304 -0.249718
      down -0.113246 -0.441528 -0.105028  0.285786

# Reordering and Sorting Levels

In [152]:
mframe.columns.names = ['objects','id']
mframe.index.names = ['colors','status']
mframe

objects             pen               paper
id                    1         2         1         2
colors status
white  up      1.562883  0.919727 -0.397509 -0.314159
       down    0.580848  1.124744  0.741454 -0.035455
red    up     -1.721348  0.989703 -1.454304 -0.249718
       down   -0.113246 -0.441528 -0.105028  0.285786

In [153]:
mframe.swaplevel('colors','status')

objects             pen               paper
id                    1         2         1         2
status colors
up     white   1.562883  0.919727 -0.397509 -0.314159
down   white   0.580848  1.124744  0.741454 -0.035455
up     red    -1.721348  0.989703 -1.454304 -0.249718
down   red    -0.113246 -0.441528 -0.105028  0.285786

In [157]:
mframe.sort_index(level='colors')

objects             pen               paper
id                    1         2         1         2
colors status
red    down   -0.113246 -0.441528 -0.105028  0.285786
       up     -1.721348  0.989703 -1.454304 -0.249718
white  down    0.580848  1.124744  0.741454 -0.035455
       up      1.562883  0.919727 -0.397509 -0.314159

### Summary Statistic by Level

In [158]:
mframe.sum(level='colors')

objects       pen               paper
id              1         2         1         2
colors
white    2.143731  2.044471  0.343945 -0.349614
red     -1.834594  0.548174 -1.559332  0.036068

In [159]:
mframe.sum(level='id',axis=1)

id                    1         2
colors status
white  up      1.165374  0.605568
       down    1.322302  1.089289
red    up     -3.175653  0.739985
       down   -0.218274 -0.155743